In [1]:
# !pip install ipython-sql sqlalchemy psycopg2

In [ ]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql postgresql+psycopg2://postgres:password@localhost:5432/basics

In [ ]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql postgresql+psycopg2://postgres:password@localhost:5432/basics

# DDL
1. CREATE
2. ALTER
3. RENAME
4. DROP
5. USE
6. TRUNCATE
7. COMMENT

# DML
1. INSERT
2. UPDATE
3. DELETE
4. REPLACE

# CREATE DATABSE

In [7]:
%%sql
CREATE DATABASE lastcourse;

 * mysql+pymysql://root:***@localhost:3306/
(pymysql.err.ProgrammingError) (1007, "Can't create database 'lastcourse'; database exists")
[SQL: CREATE DATABASE lastcourse;]
(Background on this error at: https://sqlalche.me/e/20/f405)

# CREATE TABLE

In [22]:
%%sql
create table emp ( id int primary key,
                    name char(10) not null,
                    age int not null);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

# INSERT VALUES

In [23]:
%%sql

INSERT INTO EMP (id,name,age) VALUES (1,'alex',24),(2,'akash',27);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
2 rows affected.

[]

# DQL
1. SELECT
2. FROM
3. JOINS
4. WHERE
5. GROUP BY
6. HAVING
7. ORDER BY
8. LIMIT
9. OFFSET

In [24]:
%%sql
SELECT * FROM emp;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
2 rows affected.

[(1, 'alex      ', 24), (2, 'akash     ', 27)]

# RENAME

In [8]:
%%sql
ALTER TABLE emp
RENAME COLUMN name to fname;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [9]:
%%sql
SELECT * FROM emp;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
2 rows affected.

[(1, 'alex      ', 24), (2, 'akash     ', 27)]

# UPDATE

In [10]:
%%sql
UPDATE emp
set age=30 WHERE id=2;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[]

In [11]:
%%sql
SELECT * FROM emp;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
2 rows affected.

[(1, 'alex      ', 24), (2, 'akash     ', 30)]

# DELETE

In [12]:
%%sql
DELETE FROM emp
WHERE id=2;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[]

In [28]:
%%sql
describe emp;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
(psycopg2.errors.SyntaxError) syntax error at or near "describe"
LINE 1: describe emp;
        ^

[SQL: describe emp;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [29]:
%%sql
alter table emp
rename column age to age1;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [32]:
%%sql
alter table emp
alter column age1 type decimal(10,2);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [ ]:
%%sql
ALTER TABLE emp
ALTER COLUMN age1 TYPE integer USING ROUND(CAST(age1 AS numeric));

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [41]:
%%sql
ALTER TABLE emp
ADD COLUMN date DATE;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [42]:
%%sql
ALTER TABLE emp
ADD COLUMN TIMESTAMPP TIMESTAMP;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [43]:
%%sql
INSERT INTO emp (id, name, age1, date, timestampp)
VALUES 
(1, 'Alice     ', 28, '2023-07-15', '2023-07-15 09:30:00'),
(2, 'Bob       ', 35, '2023-08-01', '2023-08-01 14:45:00'),
(3, 'Charlie   ', 42, '2023-09-10', '2023-09-10 08:00:00'),
(4, 'Diana     ', 30, '2023-10-05', '2023-10-05 17:20:00'),
(5, 'Ethan     ', 25, '2023-11-22', '2023-11-22 12:10:00');

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[]

In [44]:
%%sql
select * from emp;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[(1, 'Alice     ', 28, datetime.date(2023, 7, 15), datetime.datetime(2023, 7, 15, 9, 30)),
 (2, 'Bob       ', 35, datetime.date(2023, 8, 1), datetime.datetime(2023, 8, 1, 14, 45)),
 (3, 'Charlie   ', 42, datetime.date(2023, 9, 10), datetime.datetime(2023, 9, 10, 8, 0)),
 (4, 'Diana     ', 30, datetime.date(2023, 10, 5), datetime.datetime(2023, 10, 5, 17, 20)),
 (5, 'Ethan     ', 25, datetime.date(2023, 11, 22), datetime.datetime(2023, 11, 22, 12, 10))]

In [17]:
%%sql
SELECT * FROM emp;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
(psycopg2.errors.UndefinedTable) relation "emp" does not exist
LINE 1: SELECT * FROM emp;
                      ^

[SQL: SELECT * FROM emp;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [16]:
%%sql 
drop table emp;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [20]:
%%sql 
show tables from lastcourse;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('emp',), ('employee',)]

# 07-07-2025

# Basic DQL Usage

In [19]:
%%sql
create table data(
    orderid int primary key,
    c_name varchar(25) not null,
    location varchar(15) not null,
    category varchar(20) not null,
    unitprice int not null,
    quantity int not null,
    total int not null);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [20]:
%%sql
insert into data values(1, 'Sarah Lee', 'Mexico City', 'Electronics', 150, 1, 150),
(2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
(3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
(4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
(5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
(6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
(7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
(8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
(9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
(10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
(11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
(12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
(13, 'Ava Morales', 'San Francisco', 'Clothing', 55, 5, 275),
(14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
(15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
(16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
(17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
(18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
(19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
(20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
20 rows affected.

[]

In [21]:
%%sql
select * from data;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
20 rows affected.

[(1, 'Sarah Lee', 'Mexico City', 'Electronics', 150, 1, 150),
 (2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (13, 'Ava Morales', 'San Francisco', 'Clothing', 55, 5, 275),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
 (19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400)]

In [24]:
%%sql
SELECT c_name,location,total FROM data;

 * mysql+pymysql://root:***@localhost:3306/
20 rows affected.

[('Sarah Lee', 'Mexico City', 150),
 ('Michael Wong', 'Toronto', 300),
 ('Emily Davis', 'San Francisco', 450),
 ('David Kim', 'Vancouver', 250),
 ('Sophia Patel', 'Tokyo', 500),
 ('Liam Nguyen', 'Mexico City', 400),
 ('Isabella Rossi', 'Toronto', 225),
 ('Ethan Müller', 'San Francisco', 360),
 ('Olivia Sato', 'Vancouver', 350),
 ('Noah Dupont', 'Tokyo', 240),
 ('Emma Hernandez', 'Mexico City', 440),
 ('Jacob Kowalski', 'Toronto', 560),
 ('Ava Morales', 'San Francisco', 275),
 ('William Tanaka', 'Vancouver', 570),
 ('Mia Dupuis', 'Tokyo', 320),
 ('Alexander Ivanov', 'Mexico City', 260),
 ('Isabella Garcia', 'Toronto', 460),
 ('Daniel Moreno', 'San Francisco', 580),
 ('Sophia Nguyen', 'Vancouver', 210),
 ('John Smith', 'Tokyo', 400)]

## Qustions


1. Location, Category, QTY column data
2. Need all the data for furniture
3. Need Location,Qty for furniture
4. Need all the data where sales above 300
5. Need all the data for furniture sales above 300
6. Customer name locatio tokyo and unitprice grater than 300
7. Need all data where sales between 300 to 500
8. Need all datas where quantity from 2 to 4
9. Need all datas whos customer names starts with 'd'
10. Need all data whos customer names starts with 'no'
11. Need all data whos customer names second letter starts with 'l'
12. Need all data whos customer names ends with 'a'
13. Need all data whos customer names contains 'b'

In [25]:
%%sql
SELECT location,category,quantity FROM data;

 * mysql+pymysql://root:***@localhost:3306/
20 rows affected.

[('Mexico City', 'Electronics', 1),
 ('Toronto', 'Furniture', 1),
 ('San Francisco', 'Furniture', 3),
 ('Vancouver', 'Clothing', 5),
 ('Tokyo', 'Electronics', 2),
 ('Mexico City', 'Furniture', 1),
 ('Toronto', 'Clothing', 3),
 ('San Francisco', 'Electronics', 2),
 ('Vancouver', 'Furniture', 1),
 ('Tokyo', 'Clothing', 4),
 ('Mexico City', 'Electronics', 2),
 ('Toronto', 'Furniture', 2),
 ('San Francisco', 'Clothing', 5),
 ('Vancouver', 'Electronics', 3),
 ('Tokyo', 'Furniture', 1),
 ('Mexico City', 'Clothing', 4),
 ('Toronto', 'Electronics', 2),
 ('San Francisco', 'Furniture', 2),
 ('Vancouver', 'Clothing', 3),
 ('Tokyo', 'Electronics', 2)]

In [26]:
%%sql
SELECT * FROM data WHERE category LIKE 'furniture'

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[(2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580)]

In [27]:
%%sql
SELECT location,quantity FROM data WHERE category LIKE 'furniture';

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[('Toronto', 1),
 ('San Francisco', 3),
 ('Mexico City', 1),
 ('Vancouver', 1),
 ('Toronto', 2),
 ('Tokyo', 1),
 ('San Francisco', 2)]

In [28]:
%%sql
ALTER TABLE data RENAME COLUMN total to sales;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [29]:
%%sql
SELECT * FROM data WHERE sales>300;

 * mysql+pymysql://root:***@localhost:3306/
12 rows affected.

[(3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400)]

# AND

In [30]:
%%sql
SELECT * FROM data WHERE category LIKE 'furniture' AND sales>300;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[(3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580)]

In [31]:
%%sql
SELECT c_name FROM data WHERE location like 'tokyo' AND unitprice>300;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Mia Dupuis',)]

# BETWEEN

In [32]:
%%sql
SELECT * FROM data WHERE sales BETWEEN 300 AND 500;

 * mysql+pymysql://root:***@localhost:3306/
10 rows affected.

[(2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400)]

In [33]:
%%sql
SELECT * FROM data WHERE quantity BETWEEN 2 AND 4;

 * mysql+pymysql://root:***@localhost:3306/
13 rows affected.

[(3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
 (19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400)]

# REGEX

In [34]:
%%sql
SELECT * FROM data WHERE c_name LIKE 'd%';

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580)]

In [35]:
%%sql
SELECT * FROM data WHERE c_name LIKE 'no%';

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240)]

In [36]:
%%sql
SELECT * FROM data WHERE c_name LIKE '_l%';

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260)]

In [37]:
%%sql
SELECT * FROM data WHERE c_name LIKE '%a';

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460)]

In [38]:
%%sql
SELECT * FROM data WHERE c_name LIKE '%b%';

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[(7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460)]

# Qustions
1. Order id 2 data
2. Oreder id 5 to 11 all data
3. Order id 3,11,18 all data
4.

In [39]:
%%sql
SELECT * FROM data WHERE orderid=2;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300)]

In [40]:
%%sql
SELECT * FROM data WHERE orderid BETWEEN 5 AND 11;

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[(5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440)]

In [41]:
%%sql
SELECT * FROM data WHERE orderid in (3,11,18);

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[(3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580)]

# Task Qustions

1. Need all data who working as Data Analysist
2. Need all employee detail who are getting sallary more than 90000
3. Need and Joining date whos getting sallary from 50000 to 75000
4. Need Employee name whos age is above 38 and sallary above 90000
5. Need all data whos age is above 35
6. Need emp id and name whos age between 26 to 30
7. Need emp name whos age is 45,20,35
8. Need all data who is working in chicago
9. Need all data whos working in los angles and sallary above 76000
10. Need all data whos joined from 2022 march 1 to 2022 may 31 ("yyyy-mm-dd")
11. Need emp name whos 4th letter starts with 'n'
12. Need emp name whos 3rd letter from ends with 'i' (chrlie white)
13. Need emp name whos name starts with 'f'
14. Need all data whos emp name ends with 'n'
15. Need the role strats with 'data'
16. Need emp name whos getting sallary 30000
17. Use of where
18. Use of IN operator
19. Use of Between
20. Use of Like

In [45]:
%%sql
CREATE TABLE Employee (
    employee_id INT PRIMARY KEY,
    name VARCHAR(50),
    joining_date DATE,
    age INT,
    role VARCHAR(50),
    location VARCHAR(50),
    salary DECIMAL(10,2)
);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [46]:
%%sql
INSERT INTO Employee (employee_id, name, joining_date, age, role, location, salary) VALUES
(1, 'John Smith', '2020-01-15', 30, 'Software Engineer', 'New York', 80000.00),
(2, 'Jane Do', '2019-03-22', 28, 'HR Manager', 'Los Angeles', 75000.00),
(3, 'Alice Johnson', '2021-06-10', 35, 'Data Analyst', 'Chicago', 70000.00),
(4, 'Bob Brown', '2022-02-05', 40, 'Project Manager', 'Houston', 90000.00),
(5, 'Charlie White', '2023-05-30', 26, 'Intern', 'Miami', 30000.00),
(6, 'David Wilson', '2021-08-12', 32, 'Software Engineer', 'Seattle', 82000.00),
(7, 'Emily Davis', '2020-11-20', 29, 'HR Assistant', 'San Francisco', 60000.00),
(8, 'Frank Miller', '2019-07-15', 38, 'Data Scientist', 'Boston', 95000.00),
(9, 'Grace Lee', '2022-03-18', 31, 'Project Coordinator', 'Denver', 72000.00),
(10, 'Henry Garcia', '2023-01-25', 27, 'Intern', 'Austin', 35000.00),
(11, 'Isabella Martinez', '2021-04-30', 34, 'Software Engineer', 'New York', 81000.00),
(12, 'Jack Thompson', '2020-09-10', 36, 'HR Manager', 'Los Angeles', 77000.00),
(13, 'Karen Robinson', '2021-12-05', 29, 'Data Analyst', 'Chicago', 71000.00),
(14, 'Liam Anderson', '2022-05-15', 41, 'Project Manager', 'Houston', 92000.00),
(15, 'Mia Clark', '2023-03-20', 25, 'Intern', 'Miami', 32000.00);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
15 rows affected.

[]

In [46]:
%%sql
use lastcourse;
SELECT * FROM Employee;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
15 rows affected.

[(1, 'John Smith', datetime.date(2020, 1, 15), 30, 'Software Engineer', 'New York', Decimal('80000.00')),
 (2, 'Jane Do', datetime.date(2019, 3, 22), 28, 'HR Manager', 'Los Angeles', Decimal('75000.00')),
 (3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (5, 'Charlie White', datetime.date(2023, 5, 30), 26, 'Intern', 'Miami', Decimal('30000.00')),
 (6, 'David Wilson', datetime.date(2021, 8, 12), 32, 'Software Engineer', 'Seattle', Decimal('82000.00')),
 (7, 'Emily Davis', datetime.date(2020, 11, 20), 29, 'HR Assistant', 'San Francisco', Decimal('60000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (10, 'Henry Garcia', datetime.date(2023, 1, 25), 27, 'Intern', 'Austin', Decimal('35000.00')),
 (11, 'Isabella Martinez', datetime.date(2021, 4, 30), 34, 'Software Engineer', 'New York', Decimal('81000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00')),
 (15, 'Mia Clark', datetime.date(2023, 3, 20), 25, 'Intern', 'Miami', Decimal('32000.00'))]

In [48]:
%%sql
# 1.
SELECT * FROM Employee WHERE role LIKE 'data analyst';

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00'))]

In [49]:
%%sql
# 2.
SELECT * FROM Employee WHERE salary>90000;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00'))]

In [52]:
%%sql
# 3.
SELECT joIning_date,salary FROM Employee WHERE salary BETWEEN 50000 AND 75000;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(datetime.date(2019, 3, 22), Decimal('75000.00')),
 (datetime.date(2021, 6, 10), Decimal('70000.00')),
 (datetime.date(2020, 11, 20), Decimal('60000.00')),
 (datetime.date(2022, 3, 18), Decimal('72000.00')),
 (datetime.date(2021, 12, 5), Decimal('71000.00'))]

In [53]:
%%sql
# 4.
SELECT name FROM Employee WHERE age>38 AND salary>90000;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Liam Anderson',)]

In [54]:
%%sql
# 5.
SELECT * FROM Employee WHERE age>35;

 * mysql+pymysql://root:***@localhost:3306/
4 rows affected.

[(4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00'))]

In [56]:
%%sql
# 6.
SELECT employee_id,name FROM Employee WHERE age BETWEEN 26 AND 30;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[(1, 'John Smith'),
 (2, 'Jane Do'),
 (5, 'Charlie White'),
 (7, 'Emily Davis'),
 (10, 'Henry Garcia'),
 (13, 'Karen Robinson')]

In [58]:
%%sql
# 7.
SELECT name FROM Employee WHERE age IN (45,20,35);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Alice Johnson',)]

In [59]:
%%sql
# 8.
SELECT * FROM Employee WHERE location LIKE 'chicago';

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00'))]

In [60]:
%%sql
# 9.
SELECT * FROM Employee WHERE location LIKE 'los angeles' AND salary > 76000;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00'))]

In [61]:
%%sql
# 10.
SELECT * FROM Employee WHERE joining_date BETWEEN '2022-03-01' AND '2022-05-31';

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00'))]

In [62]:
%%sql
# 11.
SELECT name FROM Employee WHERE name like '___n%';

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('John Smith',), ('Frank Miller',)]

In [48]:
%%sql
# 12.
SELECT name FROM Employee WHERE name ILIKE '%i__j';

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
(psycopg2.errors.SyntaxError) syntax error at or near "#"
LINE 1: # 12.
        ^

[SQL: # 12.
SELECT name FROM Employee WHERE name ILIKE '%%i__j';]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [68]:
%%sql
# 13.
SELECT name FROM Employee WHERE name LIKE "f%";

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Frank Miller',)]

In [69]:
%%sql
# 14.
SELECT name FROM Employee WHERE name LIKE '%n';

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[('Alice Johnson',),
 ('Bob Brown',),
 ('David Wilson',),
 ('Jack Thompson',),
 ('Karen Robinson',),
 ('Liam Anderson',)]

In [70]:
%%sql
# 15.
SELECT * FROM Employee WHERE role LIKE 'data%';

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[(3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00'))]

In [71]:
%%sql
# 16.
SELECT name FROM Employee WHERE salary > 30000;

 * mysql+pymysql://root:***@localhost:3306/
14 rows affected.

[('John Smith',),
 ('Jane Do',),
 ('Alice Johnson',),
 ('Bob Brown',),
 ('David Wilson',),
 ('Emily Davis',),
 ('Frank Miller',),
 ('Grace Lee',),
 ('Henry Garcia',),
 ('Isabella Martinez',),
 ('Jack Thompson',),
 ('Karen Robinson',),
 ('Liam Anderson',),
 ('Mia Clark',)]

17. Use of WHERE:
Filters records based on specific conditions.
18. Use of IN Operator:
Matches a column against multiple values.
19. Use of BETWEEN:
Selects values within a given range (inclusive).
20. Use of LIKE:
Performs pattern matching using wildcards.

# Aggregation Functions

Aggregation function - Only for Numerical Column
1. SUM
2. AVG
3. MIN
4. MAX
5. COUNT
6. DISTINCT

In [3]:
%%sql
SELECT SUM(sales) FROM data;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(Decimal('7300'),)]

In [4]:
%%sql
SELECT SUM(quantity) FROM data;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(Decimal('49'),)]

In [5]:
%%sql
SELECT MIN(sales) FROM data;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(150,)]

In [6]:
%%sql
SELECT AVG(sales) FROM data;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(Decimal('365.0000'),)]

In [7]:
%%sql
SELECT MAX(sales) FROM data;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(580,)]

In [8]:
%%sql
SELECT COUNT(sales) FROM data;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(20,)]

# GROUP BY

Grouping Categorical Column in Aggregation Function of Numerical Column

# Class Qustions
1. Total Sales for each location
2. Max Qty for Each Category
3. Total Qty for each Category
4. Total sales for each location for Qty above 1
5. Total Qty for each category for sales above 300
6. Max qty each location only for electronics
7. Total Unit price for each category for sales from 300 to 500
8. Total qty for each category for total qty grater than 11
9. Total sales for each loaction for total sales above 1500
10. Total sales for each location for sales above 200
11. Max qty for each category for unit price above 250
12. Total unitprice for each category for total unitprice above 1221
13. Total qty for each category for sales above 300 and total qty above 11

In [10]:
%%sql
# 1.
SELECT location,SUM(sales) FROM data GROUP BY location;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Mexico City', Decimal('1250')),
 ('Toronto', Decimal('1545')),
 ('San Francisco', Decimal('1665')),
 ('Vancouver', Decimal('1380')),
 ('Tokyo', Decimal('1460'))]

In [11]:
%%sql
# 2.
SELECT category, MAX(quantity) FROM data GROUP BY category;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Electronics', 3), ('Furniture', 3), ('Clothing', 5)]

In [12]:
%%sql
# 3.
SELECT category,SUM(quantity) FROM data GROUP BY category;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Electronics', Decimal('14')),
 ('Furniture', Decimal('11')),
 ('Clothing', Decimal('24'))]

In [13]:
%%sql
# 4.
SELECT location,SUM(sales) FROM data WHERE quantity>1 GROUP BY location;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('San Francisco', Decimal('1665')),
 ('Vancouver', Decimal('1030')),
 ('Tokyo', Decimal('1140')),
 ('Toronto', Decimal('1245')),
 ('Mexico City', Decimal('700'))]

In [14]:
%%sql
# 5.
SELECT category,SUM(quantity) FROM data WHERE sales > 300 GROUP BY category;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Furniture', Decimal('10')), ('Electronics', Decimal('13'))]

In [15]:
%%sql
# 6.
SELECT location,MAX(quantity) FROM data WHERE category LIKE 'electronics' GROUP BY location;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Mexico City', 2),
 ('Tokyo', 2),
 ('San Francisco', 2),
 ('Vancouver', 3),
 ('Toronto', 2)]

In [16]:
%%sql
SELECT category,SUM(unitprice) FROM data WHERE sales BETWEEN 300 AND 500
GROUP BY category;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Furniture', Decimal('1520')), ('Electronics', Decimal('1080'))]

# Having
-Filtering Grouped Data

In [18]:
%%sql
# 8.
SELECT category,SUM(quantity) AS total_qty 
FROM data
GROUP BY category
HAVING total_qty>11;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Electronics', Decimal('14')), ('Clothing', Decimal('24'))]

In [19]:
%%sql
# 9.
SELECT location,SUM(sales) AS total_sales
FROM data
GROUP BY location
HAVING total_sales > 1500;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Toronto', Decimal('1545')), ('San Francisco', Decimal('1665'))]

In [20]:
%%sql
# 10.
SELECT location,SUM(sales) AS t_sales 
FROM data
WHERE sales > 200
GROUP BY location;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Toronto', Decimal('1545')),
 ('San Francisco', Decimal('1665')),
 ('Vancouver', Decimal('1380')),
 ('Tokyo', Decimal('1460')),
 ('Mexico City', Decimal('1100'))]

In [21]:
%%sql
# 11.
SELECT category,MAX(quantity) AS m_qty 
FROM data
WHERE unitprice > 250
GROUP BY category;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Furniture', 2)]

In [22]:
%%sql
# 12.
SELECT category,SUM(unitprice) AS t_unitprice
FROM data 
GROUP BY category
HAVING t_unitprice > 1221;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Electronics', Decimal('1420')), ('Furniture', Decimal('2090'))]

In [24]:
%%sql
# 13.
SELECT category,SUM(quantity) AS t_qty 
FROM data
WHERE sales > 300
GROUP BY category
HAVING t_qty > 11;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Electronics', Decimal('13'))]

# Task 08-072025 Qustions - Employee table
1. Max salary paying for data analyst
2. Avg salary paying for softwere engg
3. Total Salary paying for each role for age from 30 to 40
4. How many employees working under each role
5. How many emp working under each role for age above 32
6. Max salary paying for each role
7. Total salary for each role total salary above 1 lkh
8. Avg salary paying for each location
9. Total salary for each loaction for age above 24 and total salary above 70k
10. Avg salary for emp name starts with 'n'

In [25]:
%%sql
select * from employee;

 * mysql+pymysql://root:***@localhost:3306/
15 rows affected.

[(1, 'John Smith', datetime.date(2020, 1, 15), 30, 'Software Engineer', 'New York', Decimal('80000.00')),
 (2, 'Jane Do', datetime.date(2019, 3, 22), 28, 'HR Manager', 'Los Angeles', Decimal('75000.00')),
 (3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (5, 'Charlie White', datetime.date(2023, 5, 30), 26, 'Intern', 'Miami', Decimal('30000.00')),
 (6, 'David Wilson', datetime.date(2021, 8, 12), 32, 'Software Engineer', 'Seattle', Decimal('82000.00')),
 (7, 'Emily Davis', datetime.date(2020, 11, 20), 29, 'HR Assistant', 'San Francisco', Decimal('60000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (10, 'Henry Garcia', datetime.date(2023, 1, 25), 27, 'Intern', 'Austin', Decimal('35000.00')),
 (11, 'Isabella Martinez', datetime.date(2021, 4, 30), 34, 'Software Engineer', 'New York', Decimal('81000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00')),
 (15, 'Mia Clark', datetime.date(2023, 3, 20), 25, 'Intern', 'Miami', Decimal('32000.00'))]

In [29]:
%%sql
# 1.
SELECT role,MAX(salary) 
FROM Employee 
WHERE role LIKE 'data analyst' 
GROUP BY role;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Data Analyst', Decimal('71000.00'))]

In [30]:
%%sql
# 2.
SELECT role,AVG(salary) 
FROM Employee
WHERE role LIKE 'software engineer'
GROUP BY role;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Software Engineer', Decimal('81000.000000'))]

In [31]:
%%sql
# 3.
SELECT role,SUM(salary) 
FROM Employee
WHERE age BETWEEN 30 AND 40
GROUP BY role;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[('Software Engineer', Decimal('243000.00')),
 ('Data Analyst', Decimal('70000.00')),
 ('Project Manager', Decimal('90000.00')),
 ('Data Scientist', Decimal('95000.00')),
 ('Project Coordinator', Decimal('72000.00')),
 ('HR Manager', Decimal('77000.00'))]

In [51]:
%%sql
--# 4.
SELECT role,COUNT(*)
FROM Employee
GROUP BY role;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
8 rows affected.

[('Intern', 3),
 ('Software Engineer', 3),
 ('Project Coordinator', 1),
 ('HR Manager', 2),
 ('Data Scientist', 1),
 ('Project Manager', 2),
 ('Data Analyst', 2),
 ('HR Assistant', 1)]

In [33]:
%%sql
# 5.
SELECT role,COUNT(*) 
FROM Employee
WHERE age > 32
GROUP BY role;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Data Analyst', 1),
 ('Project Manager', 2),
 ('Data Scientist', 1),
 ('Software Engineer', 1),
 ('HR Manager', 1)]

In [34]:
%%sql
# 6.
SELECT role,MAX(salary)
FROM Employee
GROUP BY role;

 * mysql+pymysql://root:***@localhost:3306/
8 rows affected.

[('Software Engineer', Decimal('82000.00')),
 ('HR Manager', Decimal('77000.00')),
 ('Data Analyst', Decimal('71000.00')),
 ('Project Manager', Decimal('92000.00')),
 ('Intern', Decimal('35000.00')),
 ('HR Assistant', Decimal('60000.00')),
 ('Data Scientist', Decimal('95000.00')),
 ('Project Coordinator', Decimal('72000.00'))]

In [35]:
%%sql
# 7.
SELECT role,SUM(salary) AS t_sal
FROM Employee
GROUP BY role
HAVING t_sal > 100000;

 * mysql+pymysql://root:***@localhost:3306/
4 rows affected.

[('Software Engineer', Decimal('243000.00')),
 ('HR Manager', Decimal('152000.00')),
 ('Data Analyst', Decimal('141000.00')),
 ('Project Manager', Decimal('182000.00'))]

In [36]:
%%sql
# 8.
SELECT location,AVG(salary)
FROM Employee
GROUP BY location;

 * mysql+pymysql://root:***@localhost:3306/
10 rows affected.

[('New York', Decimal('80500.000000')),
 ('Los Angeles', Decimal('76000.000000')),
 ('Chicago', Decimal('70500.000000')),
 ('Houston', Decimal('91000.000000')),
 ('Miami', Decimal('31000.000000')),
 ('Seattle', Decimal('82000.000000')),
 ('San Francisco', Decimal('60000.000000')),
 ('Boston', Decimal('95000.000000')),
 ('Denver', Decimal('72000.000000')),
 ('Austin', Decimal('35000.000000'))]

In [37]:
%%sql
# 9.
SELECT location, SUM(salary) AS t_sal
FROM Employee
WHERE age > 24
GROUP BY location
HAVING t_sal > 70000;

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[('New York', Decimal('161000.00')),
 ('Los Angeles', Decimal('152000.00')),
 ('Chicago', Decimal('141000.00')),
 ('Houston', Decimal('182000.00')),
 ('Seattle', Decimal('82000.00')),
 ('Boston', Decimal('95000.00')),
 ('Denver', Decimal('72000.00'))]

In [40]:
%%sql
# 10.
SELECT name,AVG(salary) 
FROM Employee
WHERE name LIKE '%n'
GROUP BY name;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[('Alice Johnson', Decimal('70000.000000')),
 ('Bob Brown', Decimal('90000.000000')),
 ('David Wilson', Decimal('82000.000000')),
 ('Jack Thompson', Decimal('77000.000000')),
 ('Karen Robinson', Decimal('71000.000000')),
 ('Liam Anderson', Decimal('92000.000000'))]

# 08-07-2025 Task Qustions- Sales Data Table
1. Total qty sold out in grade A
2. Total amount sold out
3. Max amt
4. Avg amt
5. Min qty
6. Sales person whos name starts with 'A'
7. How many qty sold out be each sales person
8. Total amt sold out by each sales person for Grade 'B'
9. Total qty sold out for each products
10. Total qty for each product name fo Grade "A" and total qty greater than 1
11. Total amt for each product name for qty greater than 1
12. Sales person who soldout amt 1000
13. Total amt for each product which total amt is greater than 400
14. Total amt for each product name which total amt from 100 to 500
15. Total amt for each sales person
16. Max qty for each sales person
17. Total amt for each sales person for date from 3 jun 2025 to 5 jul 2025

In [52]:
%%sql
CREATE TABLE sales_data (
    id INT PRIMARY KEY,
    salesperson VARCHAR(50),
    sale_date DATE,
    product_name VARCHAR(100),
    quantity INT,
    amount DECIMAL(10, 2),
    grade CHAR(1)
);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [53]:
%%sql
INSERT INTO sales_data (id, salesperson, sale_date, product_name, quantity, amount, grade) VALUES
(1, 'Alice',   '2025-06-01', 'Laptop',     1, 1000.00, 'A'),
(2, 'Bob',     '2025-06-03', 'Printer',    2,  150.00, 'B'),
(3, 'Alice',   '2025-06-10', 'Mouse',      5,  200.00, 'A'),
(4, 'Charlie', '2025-06-15', 'Keyboard',   3,  120.00, 'C'),
(5, 'Bob',     '2025-07-01', 'Monitor',    2,  300.00, 'B'),
(6, 'Alice',   '2025-07-05', 'Laptop',     1, 1000.00, 'A'),
(7, 'Charlie', '2025-07-10', 'Mouse',      4,  100.00, 'C'),
(8, 'Bob',     '2025-07-15', 'Keyboard',   3,  200.00, 'B');

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
8 rows affected.

[]

In [54]:
%%sql
CREATE TABLE sales (
    id INT PRIMARY KEY,
    salesperson VARCHAR(50),
    sale_date DATE,
    product_name VARCHAR(100),
    quantity INT,
    amount DECIMAL(10, 2),
    grade CHAR(1)
);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [55]:
%%sql
INSERT INTO sales (id, salesperson, sale_date, product_name, quantity, amount, grade) VALUES
(1, 'Alice',   '2025-06-01', 'Laptop',     1, 1000.00, 'A'),
(2, 'Bob',     '2025-06-03', 'Printer',    2,  150.00, 'B'),
(3, 'Alice',   '2025-06-10', 'Mouse',      5,  200.00, 'A'),
(4, 'Charlie', '2025-06-15', 'Keyboard',   3,  120.00, 'C'),
(5, 'Bob',     '2025-07-01', 'Monitor',    2,  300.00, 'B'),
(6, 'Alice',   '2025-07-05', 'Laptop',     1, 1000.00, 'A'),
(7, 'Charlie', '2025-07-10', 'Mouse',      4,  100.00, 'C'),
(8, 'Bob',     '2025-07-15', 'Keyboard',   3,  200.00, 'B');

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
8 rows affected.

[]

In [56]:
%%sql
SELECT * FROM sales;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
8 rows affected.

[(1, 'Alice', datetime.date(2025, 6, 1), 'Laptop', 1, Decimal('1000.00'), 'A'),
 (2, 'Bob', datetime.date(2025, 6, 3), 'Printer', 2, Decimal('150.00'), 'B'),
 (3, 'Alice', datetime.date(2025, 6, 10), 'Mouse', 5, Decimal('200.00'), 'A'),
 (4, 'Charlie', datetime.date(2025, 6, 15), 'Keyboard', 3, Decimal('120.00'), 'C'),
 (5, 'Bob', datetime.date(2025, 7, 1), 'Monitor', 2, Decimal('300.00'), 'B'),
 (6, 'Alice', datetime.date(2025, 7, 5), 'Laptop', 1, Decimal('1000.00'), 'A'),
 (7, 'Charlie', datetime.date(2025, 7, 10), 'Mouse', 4, Decimal('100.00'), 'C'),
 (8, 'Bob', datetime.date(2025, 7, 15), 'Keyboard', 3, Decimal('200.00'), 'B')]

In [58]:
%%sql
--# 1.
SELECT grade,SUM(quantity) as total_qty
FROM sales
WHERE grade ILIKE 'A'
GROUP BY grade;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[('A', 7)]

In [59]:
%%sql
--# 2.
SELECT SUM(amount)
FROM sales;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[(Decimal('3070.00'),)]

In [60]:
%%sql
--# 3.
SELECT MAX(amount)
FROM sales;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[(Decimal('1000.00'),)]

In [61]:
%%sql
--# 4.
SELECT AVG(amount)
FROM sales;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[(Decimal('383.7500000000000000'),)]

In [62]:
%%sql
--# 5.
SELECT MIN(quantity)
FROM sales;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[(1,)]

In [64]:
%%sql
--# 6.
SELECT salesperson
FROM sales
WHERE salesperson ILIKE 'a%';

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
3 rows affected.

[('Alice',), ('Alice',), ('Alice',)]

In [65]:
%%sql
--# 7.
SELECT salesperson, SUM(quantity)
FROM sales
GROUP BY salesperson;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
3 rows affected.

[('Alice', 7), ('Bob', 7), ('Charlie', 7)]

In [66]:
%%sql
--# 8.
SELECT salesperson,SUM(amount)
FROM sales
WHERE grade LIKE 'B'
GROUP BY salesperson;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[('Bob', Decimal('650.00'))]

In [67]:
%%sql
--# 9.
SELECT product_name,SUM(quantity)
FROM sales
GROUP BY product_name;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[('Printer', 2), ('Mouse', 9), ('Keyboard', 6), ('Monitor', 2), ('Laptop', 2)]

In [69]:
%%sql
--# 10.
SELECT product_name,SUM(quantity) AS t_qty
FROM sales
WHERE grade ILIKE 'A'
GROUP BY product_name
HAVING SUM(quantity) > 1;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
2 rows affected.

[('Mouse', 5), ('Laptop', 2)]

In [70]:
%%sql
--# 11.
SELECT product_name, SUM(amount)
FROM sales
WHERE quantity > 1
GROUP BY product_name;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
4 rows affected.

[('Keyboard', Decimal('320.00')),
 ('Printer', Decimal('150.00')),
 ('Monitor', Decimal('300.00')),
 ('Mouse', Decimal('300.00'))]

In [71]:
%%sql
--# 12.
SELECT salesperson
FROM sales
WHERE amount = 1000
GROUP BY salesperson;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[('Alice',)]

In [73]:
%%sql
--# 13.
SELECT product_name,SUM(amount) AS t_amt
FROM sales
GROUP BY product_name
HAVING SUM(quantity) > 400;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
0 rows affected.

[]

In [28]:
%%sql
# 14.
SELECT product_name,SUM(amount) AS t_amt
FROM sales
GROUP BY product_name
HAVING t_amt BETWEEN 100 AND 500;

 * mysql+pymysql://root:***@localhost:3306/
4 rows affected.

[('Printer', Decimal('150.00')),
 ('Mouse', Decimal('300.00')),
 ('Keyboard', Decimal('320.00')),
 ('Monitor', Decimal('300.00'))]

In [29]:
%%sql
# 15.
SELECT salesperson,SUM(amount) AS t_amt
FROM sales
GROUP BY salesperson;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Alice', Decimal('2200.00')),
 ('Bob', Decimal('650.00')),
 ('Charlie', Decimal('220.00'))]

In [30]:
%%sql
# 16.
SELECT salesperson,MAX(quantity)
FROM sales
GROUP BY salesperson;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Alice', 5), ('Bob', 3), ('Charlie', 4)]

In [32]:
%%sql
# 17.
SELECT salesperson,SUM(amount)
FROM sales
WHERE sale_date BETWEEN '2025-06-03' AND '2025-07-05'
GROUP BY salesperson;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Bob', Decimal('450.00')),
 ('Alice', Decimal('1200.00')),
 ('Charlie', Decimal('120.00'))]

# 09-07-2025

# ORDER BY

In [9]:
%%sql
USE lastcourse;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [13]:
%%sql
SELECT * FROM data ORDER BY sales asc;

 * mysql+pymysql://root:***@localhost:3306/
20 rows affected.

[(1, 'Sarah Lee', 'Mexico City', 'Electronics', 150, 1, 150),
 (19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
 (13, 'Ava Morales', 'San Francisco', 'Clothing', 55, 5, 275),
 (2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580)]

In [14]:
%%sql
SELECT * FROM data ORDER BY sales;

 * mysql+pymysql://root:***@localhost:3306/
20 rows affected.

[(1, 'Sarah Lee', 'Mexico City', 'Electronics', 150, 1, 150),
 (19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
 (13, 'Ava Morales', 'San Francisco', 'Clothing', 55, 5, 275),
 (2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580)]

In [15]:
%%sql
SELECT * FROM data ORDER BY sales desc;

 * mysql+pymysql://root:***@localhost:3306/
20 rows affected.

[(18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (13, 'Ava Morales', 'San Francisco', 'Clothing', 55, 5, 275),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
 (4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
 (1, 'Sarah Lee', 'Mexico City', 'Electronics', 150, 1, 150)]

# LIMIT

In [17]:
%%sql
# Highest top 2 sales
SELECT * 
FROM data
ORDER BY sales DESC
LIMIT 2;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570)]

# OFFSET

In [19]:
%%sql
# Second Highest
SELECT * FROM data ORDER BY sales DESC LIMIT 1 OFFSET 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570)]

In [21]:
%%sql
# 3rd, 4th Highest
SELECT * FROM data ORDER BY sales DESC LIMIT 2 OFFSET 2;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500)]

# Class Qustions - DATA table
1. Top location based on total sales
2. which category has highest amt of total sales

In [29]:
%%sql
# 1.
SELECT location,SUM(sales) AS tsales FROM data GROUP BY location ORDER BY tsales DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('San Francisco', Decimal('1665'))]

In [30]:
%%sql
# 1.
SELECT location FROM data GROUP BY location ORDER BY SUM(sales) DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('San Francisco',)]

In [31]:
%%sql
# 2.
SELECT category FROM data GROUP BY category ORDER BY SUM(sales) DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Furniture',)]

# Class Qustions - Employee Table
1. Which emp reciving the highest salary
2. Which emp getting highest salary as a project manager
3. Which role has the highest amt of total salary

In [33]:
%%sql
SELECT name FROM Employee ORDER BY salary DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Frank Miller',)]

In [34]:
%%sql
SELECT name FROM Employee WHERE role LIKE 'project manager' ORDER BY salary DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Liam Anderson',)]

In [35]:
%%sql
SELECT role FROM Employee GROUP BY role ORDER BY SUM(salary) DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Software Engineer',)]

# 09 -07-2025 Task QUstions
1. Top Employee based on salary whos age is above 38 and sallary above 90000- EMPLOYEE TABLE
2. Top 1 product (Total amt for each product name for qty greater than 1)- SALES TABLE
3. Top 1 Total amt for each sales person- SALES TABLE
4. Emp table which role has the highest no of emp working- EMPLOYEE TABLE
5. sql coding order
6. use of offset

In [9]:
%%sql
SELECT name 
FROM Employee
ORDER BY salary DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Frank Miller',)]

In [11]:
%%sql
SELECT product_name 
FROM sales
WHERE quantity>1
GROUP BY product_name
ORDER BY SUM(amount) DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Keyboard',)]

In [12]:
%%sql
SELECT salesperson
FROM sales
GROUP BY salesperson
ORDER BY SUM(amount) DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Alice',)]

In [13]:
%%sql
SELECT role
FROM Employee
GROUP BY role
ORDER BY COUNT(*) DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Software Engineer',)]

In [5]:
%%sql
SELECT * FROM Employee;

 * mysql+pymysql://root:***@localhost:3306/
15 rows affected.

[(1, 'John Smith', datetime.date(2020, 1, 15), 30, 'Software Engineer', 'New York', Decimal('80000.00')),
 (2, 'Jane Do', datetime.date(2019, 3, 22), 28, 'HR Manager', 'Los Angeles', Decimal('75000.00')),
 (3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (5, 'Charlie White', datetime.date(2023, 5, 30), 26, 'Intern', 'Miami', Decimal('30000.00')),
 (6, 'David Wilson', datetime.date(2021, 8, 12), 32, 'Software Engineer', 'Seattle', Decimal('82000.00')),
 (7, 'Emily Davis', datetime.date(2020, 11, 20), 29, 'HR Assistant', 'San Francisco', Decimal('60000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (10, 'Henry Garcia', datetime.date(2023, 1, 25), 27, 'Intern', 'Austin', Decimal('35000.00')),
 (11, 'Isabella Martinez', datetime.date(2021, 4, 30), 34, 'Software Engineer', 'New York', Decimal('81000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00')),
 (15, 'Mia Clark', datetime.date(2023, 3, 20), 25, 'Intern', 'Miami', Decimal('32000.00'))]

5. SQL Coding Order
   1. SELECT
   2. FROM
   3. WHERE
   4. GROUP BY
   5. ORDER BY
   6. HAVING
   7. LIMIT

# 6. Use of OFFSET
    1. Used to skip number of rows. OFFSET 2 refres skips first 2 rows

# DATE FUNCTION

1. CURDATE() Current time        SELECT CURDATE()
2. CURTIME() Current time          SELECT CURTIME
3. NOW() Current DATE/TIME       SELECT NOW()
4. TIMESTAMPDIFF(UNIT  ,date column1,date column2)
5. DATEDIFF(date1,date2) means date1-date2 and output will be in days intervel. date1 must be big date if you want +ve result.
6. YEAR(date column)
7. MONTH(date column)

PostgreSQL has a rich set of **date and time functions** that let you manipulate, format, and extract parts of dates and timestamps. Here's a handy guide to the most useful ones:

---

### 📅 1. **Current Date & Time**
```sql
SELECT CURRENT_DATE;         -- Returns today's date
SELECT CURRENT_TIME;         -- Returns current time
SELECT CURRENT_TIMESTAMP;    -- Returns date + time
SELECT NOW();                -- Same as CURRENT_TIMESTAMP
```

---

### 🧩 2. **Extract Parts of a Date**
```sql
SELECT EXTRACT(YEAR FROM date_column);     -- Year
SELECT EXTRACT(MONTH FROM date_column);    -- Month
SELECT EXTRACT(DAY FROM date_column);      -- Day
SELECT EXTRACT(DOW FROM date_column);      -- Day of week (0=Sunday)
```

---

### 🔄 3. **Date Arithmetic**
```sql
SELECT date_column + INTERVAL '5 days';    -- Add 5 days
SELECT date_column - INTERVAL '2 months';  -- Subtract 2 months
SELECT AGE(date_column);                   -- Difference from now
SELECT AGE(date_column, '2020-01-01');     -- Difference from specific date
```

---

### 🧼 4. **Formatting Dates**
```sql
SELECT TO_CHAR(date_column, 'YYYY-MM-DD');         -- Format as string
SELECT TO_CHAR(date_column, 'Month DD, YYYY');     -- "August 11, 2025"
SELECT TO_CHAR(NOW(), 'HH24:MI:SS');               -- Time in 24-hour format
```

---

### 🔍 5. **Date Comparison**
```sql
SELECT * FROM emp WHERE date = CURRENT_DATE;
SELECT * FROM emp WHERE date BETWEEN '2023-01-01' AND '2023-12-31';
```

---




---

### 🕒 1. **Current Date & Time Functions**
| Function               | Description |
|------------------------|-------------|
| `CURRENT_DATE`         | Returns current date |
| `CURRENT_TIME`         | Returns current time |
| `CURRENT_TIMESTAMP`    | Returns current date and time |
| `NOW()`                | Same as `CURRENT_TIMESTAMP` |
| `CLOCK_TIMESTAMP()`    | Returns actual current time (changes during execution) |
| `STATEMENT_TIMESTAMP()`| Timestamp at start of current statement |
| `TRANSACTION_TIMESTAMP()` | Timestamp at start of current transaction |
| `LOCALTIME`            | Time at transaction start |
| `LOCALTIMESTAMP`       | Date and time at transaction start |

---

### 🔍 2. **Extracting Components**
| Function         | Description |
|------------------|-------------|
| `EXTRACT(field FROM source)` | Extracts part of a date/time (e.g. year, month) |
| `DATE_PART(field, source)`   | Same as `EXTRACT` |
| `DATE_TRUNC(field, source)`  | Truncates to specified precision (e.g. month, year) |

---

### 🔄 3. **Conversion Functions**
| Function               | Description |
|------------------------|-------------|
| `TO_DATE(text, format)`       | Converts string to date |
| `TO_TIMESTAMP(text, format)`  | Converts string to timestamp |
| `MAKE_DATE(year, month, day)` | Constructs a date |
| `MAKE_TIME(hour, minute, second)` | Constructs a time |

---

### ⏳ 4. **Interval & Arithmetic**
| Function               | Description |
|------------------------|-------------|
| `AGE(date1, date2)`    | Returns interval between two dates |
| `JUSTIFY_DAYS(interval)` | Converts 30-day intervals to months |
| `JUSTIFY_HOURS(interval)` | Converts 24-hour intervals to days |
| `JUSTIFY_INTERVAL(interval)` | Adjusts interval for readability |
| `MAKE_INTERVAL(...)`   | Constructs interval from components |

---

### 🌐 5. **Time Zone Handling**
| Function               | Description |
|------------------------|-------------|
| `AT TIME ZONE zone`    | Converts timestamp to specified time zone |

---

### 🧰 6. **Utility Functions**
| Function               | Description |
|------------------------|-------------|
| `ISFINITE(date/timestamp/interval)` | Checks if value is finite |
| `TIMEOFDAY()`          | Returns current time as text |
| `PG_SLEEP(seconds)`    | Pauses execution for given seconds |

---

For full documentation and examples, check out [PostgreSQL’s official date/time functions guide](https://www.postgresql.org/docs/current/functions-datetime.html) or this [GeeksforGeeks overview](https://www.geeksforgeeks.org/postgresql/postgresql-date-functions/).

In [12]:
%%sql
SELECT CURDATE(), CURTIME(),NOW();

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(datetime.date(2025, 7, 10), datetime.timedelta(seconds=63510), datetime.datetime(2025, 7, 10, 17, 38, 30))]

# Class Qustions
1. How many days my emp are working
2. How many year my emp are working
3. Emp name who joined on may 2023
4. Emp name who joined from jan 2023 to may 2023
5. Emp name who joined after 2020

In [19]:
%%sql
SELECT 
    name,
    joining_date,
    TIMESTAMPDIFF(DAY,joining_date,CURDATE()) AS days_working,
    TIMESTAMPDIFF(YEAR,joining_date,CURDATE()) AS years_working,
    DATEDIFF(CURDATE(),joining_date) AS days_work,
    DATEDIFF(joining_date,CURDATE()) AS 'neg_day_working(worng)'
FROM Employee;

 * mysql+pymysql://root:***@localhost:3306/
15 rows affected.

[('John Smith', datetime.date(2020, 1, 15), 2003, 5, 2003, -2003),
 ('Jane Do', datetime.date(2019, 3, 22), 2302, 6, 2302, -2302),
 ('Alice Johnson', datetime.date(2021, 6, 10), 1491, 4, 1491, -1491),
 ('Bob Brown', datetime.date(2022, 2, 5), 1251, 3, 1251, -1251),
 ('Charlie White', datetime.date(2023, 5, 30), 772, 2, 772, -772),
 ('David Wilson', datetime.date(2021, 8, 12), 1428, 3, 1428, -1428),
 ('Emily Davis', datetime.date(2020, 11, 20), 1693, 4, 1693, -1693),
 ('Frank Miller', datetime.date(2019, 7, 15), 2187, 5, 2187, -2187),
 ('Grace Lee', datetime.date(2022, 3, 18), 1210, 3, 1210, -1210),
 ('Henry Garcia', datetime.date(2023, 1, 25), 897, 2, 897, -897),
 ('Isabella Martinez', datetime.date(2021, 4, 30), 1532, 4, 1532, -1532),
 ('Jack Thompson', datetime.date(2020, 9, 10), 1764, 4, 1764, -1764),
 ('Karen Robinson', datetime.date(2021, 12, 5), 1313, 3, 1313, -1313),
 ('Liam Anderson', datetime.date(2022, 5, 15), 1152, 3, 1152, -1152),
 ('Mia Clark', datetime.date(2023, 3, 20), 843, 2, 843, -843)]

In [15]:
%%sql
SELECT * FROM Employee;

 * mysql+pymysql://root:***@localhost:3306/
15 rows affected.

[(1, 'John Smith', datetime.date(2020, 1, 15), 30, 'Software Engineer', 'New York', Decimal('80000.00')),
 (2, 'Jane Do', datetime.date(2019, 3, 22), 28, 'HR Manager', 'Los Angeles', Decimal('75000.00')),
 (3, 'Alice Johnson', datetime.date(2021, 6, 10), 35, 'Data Analyst', 'Chicago', Decimal('70000.00')),
 (4, 'Bob Brown', datetime.date(2022, 2, 5), 40, 'Project Manager', 'Houston', Decimal('90000.00')),
 (5, 'Charlie White', datetime.date(2023, 5, 30), 26, 'Intern', 'Miami', Decimal('30000.00')),
 (6, 'David Wilson', datetime.date(2021, 8, 12), 32, 'Software Engineer', 'Seattle', Decimal('82000.00')),
 (7, 'Emily Davis', datetime.date(2020, 11, 20), 29, 'HR Assistant', 'San Francisco', Decimal('60000.00')),
 (8, 'Frank Miller', datetime.date(2019, 7, 15), 38, 'Data Scientist', 'Boston', Decimal('95000.00')),
 (9, 'Grace Lee', datetime.date(2022, 3, 18), 31, 'Project Coordinator', 'Denver', Decimal('72000.00')),
 (10, 'Henry Garcia', datetime.date(2023, 1, 25), 27, 'Intern', 'Austin', Decimal('35000.00')),
 (11, 'Isabella Martinez', datetime.date(2021, 4, 30), 34, 'Software Engineer', 'New York', Decimal('81000.00')),
 (12, 'Jack Thompson', datetime.date(2020, 9, 10), 36, 'HR Manager', 'Los Angeles', Decimal('77000.00')),
 (13, 'Karen Robinson', datetime.date(2021, 12, 5), 29, 'Data Analyst', 'Chicago', Decimal('71000.00')),
 (14, 'Liam Anderson', datetime.date(2022, 5, 15), 41, 'Project Manager', 'Houston', Decimal('92000.00')),
 (15, 'Mia Clark', datetime.date(2023, 3, 20), 25, 'Intern', 'Miami', Decimal('32000.00'))]

In [20]:
%%sql
SELECT name,joining_date FROM Employee WHERE joining_date BETWEEN '2023-05-01' AND '2023-05-31';

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Charlie White', datetime.date(2023, 5, 30))]

In [22]:
%%sql
SELECT name,joining_date FROM Employee WHERE joining_date BETWEEN '2023-01-01' AND '2023-05-31';

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Charlie White', datetime.date(2023, 5, 30)),
 ('Henry Garcia', datetime.date(2023, 1, 25)),
 ('Mia Clark', datetime.date(2023, 3, 20))]

In [24]:
%%sql
SELECT name,joining_date FROM Employee WHERE joining_date>='2021-01-01';

 * mysql+pymysql://root:***@localhost:3306/
10 rows affected.

[('Alice Johnson', datetime.date(2021, 6, 10)),
 ('Bob Brown', datetime.date(2022, 2, 5)),
 ('Charlie White', datetime.date(2023, 5, 30)),
 ('David Wilson', datetime.date(2021, 8, 12)),
 ('Grace Lee', datetime.date(2022, 3, 18)),
 ('Henry Garcia', datetime.date(2023, 1, 25)),
 ('Isabella Martinez', datetime.date(2021, 4, 30)),
 ('Karen Robinson', datetime.date(2021, 12, 5)),
 ('Liam Anderson', datetime.date(2022, 5, 15)),
 ('Mia Clark', datetime.date(2023, 3, 20))]

In [27]:
%%sql
SELECT name,joining_date,DAY(joining_date),MONTH(joining_date),YEAR(joining_date),week(joining_date),QUARTER(joining_date) FROM Employee;

 * mysql+pymysql://root:***@localhost:3306/
15 rows affected.

[('John Smith', datetime.date(2020, 1, 15), 15, 1, 2020, 2, 1),
 ('Jane Do', datetime.date(2019, 3, 22), 22, 3, 2019, 11, 1),
 ('Alice Johnson', datetime.date(2021, 6, 10), 10, 6, 2021, 23, 2),
 ('Bob Brown', datetime.date(2022, 2, 5), 5, 2, 2022, 5, 1),
 ('Charlie White', datetime.date(2023, 5, 30), 30, 5, 2023, 22, 2),
 ('David Wilson', datetime.date(2021, 8, 12), 12, 8, 2021, 32, 3),
 ('Emily Davis', datetime.date(2020, 11, 20), 20, 11, 2020, 46, 4),
 ('Frank Miller', datetime.date(2019, 7, 15), 15, 7, 2019, 28, 3),
 ('Grace Lee', datetime.date(2022, 3, 18), 18, 3, 2022, 11, 1),
 ('Henry Garcia', datetime.date(2023, 1, 25), 25, 1, 2023, 4, 1),
 ('Isabella Martinez', datetime.date(2021, 4, 30), 30, 4, 2021, 17, 2),
 ('Jack Thompson', datetime.date(2020, 9, 10), 10, 9, 2020, 36, 3),
 ('Karen Robinson', datetime.date(2021, 12, 5), 5, 12, 2021, 49, 4),
 ('Liam Anderson', datetime.date(2022, 5, 15), 15, 5, 2022, 20, 2),
 ('Mia Clark', datetime.date(2023, 3, 20), 20, 3, 2023, 12, 1)]

# Null Handling

1. is null
2. is not null
3. if null
4. coalesce

In [2]:
%%sql
use lastcourse;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [74]:
%%sql
create table nulls(id int not null,firstname varchar(20) unique,middlename varchar(20) unique,salary int unique);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [75]:
%%sql
INSERT INTO nulls (id, firstname, middlename, salary) 
VALUES 
    (1, NULL, 'John', 50000),
    (2, 'Alice', NULL, NULL),
    (3, NULL, 'Bob', 60000),
    (4, 'Charlie', NULL, NULL),
    (5, NULL, 'David', 70000);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[]

In [76]:
%%sql
SELECT * FROM nulls;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[(1, None, 'John', 50000),
 (2, 'Alice', None, None),
 (3, None, 'Bob', 60000),
 (4, 'Charlie', None, None),
 (5, None, 'David', 70000)]

In [77]:
%%sql
SELECT id,firstname FROM nulls WHERE firstname IS NULL;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
3 rows affected.

[(1, None), (3, None), (5, None)]

In [78]:
%%sql
SELECT id,firstname FROM nulls WHERE firstname IS NOT NULL;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
2 rows affected.

[(2, 'Alice'), (4, 'Charlie')]

In [79]:
%%sql
SELECT id,firstname,IFNULL(firstname,"unknown") AS new_name FROM nulls;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
(psycopg2.errors.UndefinedColumn) column "unknown" does not exist
LINE 1: SELECT id,firstname,IFNULL(firstname,"unknown") AS new_name ...
                                             ^

[SQL: SELECT id,firstname,IFNULL(firstname,"unknown") AS new_name FROM nulls;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [12]:
%%sql
SELECT id,salary,IFNULL(salary,20000) AS new_salary FROM nulls;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 50000, 50000),
 (2, None, 20000),
 (3, 60000, 60000),
 (4, None, 20000),
 (5, 70000, 70000)]

In [81]:
%%sql
SELECT
    firstname,middlename,COALESCE(firstname,middlename,'unknown') AS new_name
FROM
    nulls;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[(None, 'John', 'John'),
 ('Alice', None, 'Alice'),
 (None, 'Bob', 'Bob'),
 ('Charlie', None, 'Charlie'),
 (None, 'David', 'David')]

In [18]:
%%sql
SELECT * FROM products;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[(201, 'Laptop', Decimal('1200.00')),
 (202, 'Smartphone', Decimal('800.00')),
 (203, 'Tablet', Decimal('400.00')),
 (204, 'Headphones', Decimal('150.00')),
 (205, 'Smartwatch', Decimal('250.00')),
 (206, 'pen', Decimal('100.00'))]

In [17]:
%%sql
INSERT INTO products VALUES (206,"pen",100);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[]

# String Function

In [82]:
%%sql
SELECT * FROM employees3;

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
(psycopg2.errors.UndefinedTable) relation "employees3" does not exist
LINE 1: SELECT * FROM employees3;
                      ^

[SQL: SELECT * FROM employees3;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [62]:
%%sql
SELECT name,
        LEFT(name,3) AS "Left 3 letters",
        RIGHT(name,3) AS "Right 3 letters",
        SUBSTRING_INDEX(name," ",1) AS "first name",
        # SUBSTRING_INDEX(name," ",1,-1) AS "middle name",
        SUBSTRING_INDEX(name," ",-1) AS "last name",
        CONCAT(name,"@",department) AS "name@dept",
        REPLACE(name,"o","oooooooo") AS replaced
FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[('Alice Johnson', 'Ali', 'son', 'Alice', 'Johnson', 'Alice Johnson@HR', 'Alice Joooooooohnsoooooooon'),
 ('Bob Smith', 'Bob', 'ith', 'Bob', 'Smith', 'Bob Smith@HR', 'Boooooooob Smith'),
 ('Charlie Brown', 'Cha', 'own', 'Charlie', 'Brown', 'Charlie Brown@IT', 'Charlie Broooooooown'),
 ('David Wilson', 'Dav', 'son', 'David', 'Wilson', 'David Wilson@IT', 'David Wilsoooooooon'),
 ('Eva Green', 'Eva', 'een', 'Eva', 'Green', 'Eva Green@Sales', 'Eva Green'),
 ('Frank White', 'Fra', 'ite', 'Frank', 'White', 'Frank White@Sales', 'Frank White'),
 ('Grace Black', 'Gra', 'ack', 'Grace', 'Black', 'Grace Black@IT', 'Grace Black')]

In [22]:
%%sql
SELECT name,CONCAT(SUBSTRING_INDEX(name," ",1),RIGHT(name,3),"@gmail.com") AS email
FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[('Alice Johnson', 'Aliceson@gmail.com'),
 ('Bob Smith', 'Bobith@gmail.com'),
 ('Charlie Brown', 'Charlieown@gmail.com'),
 ('David Wilson', 'Davidson@gmail.com'),
 ('Eva Green', 'Evaeen@gmail.com'),
 ('Frank White', 'Frankite@gmail.com'),
 ('Grace Black', 'Graceack@gmail.com')]

In [83]:
%%sql
CREATE TABLE course (
    course_id INT PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    trainer VARCHAR(50) NOT NULL
);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [ ]:
%%sql
INSERT INTO course (course_id, name, trainer) VALUES
(1, 'Computer Science', 'Dr. Smith'),
(2, 'Mathematics', 'Prof. Johnson'),
(3, 'Physics', 'Dr. Brown'),
(4, 'Chemistry', 'Dr. White'),
(5, 'Biology', 'Prof. Green');

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[]

In [85]:
%%sql
CREATE TABLE student (
    id INT PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    address VARCHAR(100),
    course_id INT,
    age INT,
    fees DECIMAL(10, 2),
    FOREIGN KEY (course_id) REFERENCES course(course_id)
);
INSERT INTO student (id, name, address, course_id, age, fees) VALUES
(1, 'Alice', '123 Maple St.', 1, 20, 1500.00),
(2, 'Bob', '456 Oak St.', 2, 22, 1200.00),
(3, 'Charlie', '789 Pine St.', 3, 21, 1300.00),
(4, 'David', '321 Elm St.', 4, 23, 1400.00),
(5, 'Eva', '654 Cedar St.', 5, 19, 1100.00),
(6, 'Frank', '987 Birch St.', 1, 20, 1500.00),
(7, 'Grace', '135 Maple St.', 2, 22, 1200.00),
(8, 'Henry', '246 Oak St.', 3, 21, 1300.00),
(9, 'Irene', '369 Pine St.', 4, 23, 1400.00),
(10, 'Jack', '147 Elm St.', 5, 19, 1100.00),
(11, 'Alice', '123 Maple St.', 2, 20, 1500.00),  -- Additional enrollment for Alice
(12, 'Alice', '123 Maple St.', 3, 20, 1500.00),  -- Additional enrollment for Alice
(13, 'Bob', '456 Oak St.', 4, 22, 1200.00),      -- Additional enrollment for Bob
(14, 'Bob', '456 Oak St.', 5, 22, 1200.00),      -- Additional enrollment for Bob
(15, 'Charlie', '789 Pine St.', 4, 21, 1300.00), -- Additional enrollment for Charlie
(16, 'Charlie', '789 Pine St.', 5, 21, 1300.00); -- Additional enrollment for Charlie

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.
16 rows affected.

[]

In [87]:
%%sql
INSERT INTO course (course_id, name, trainer) VALUES
(6, 'Science', 'Dr. mangatha');

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
1 rows affected.

[]

In [ ]:
%%sql
CREATE TABLE Customers (
    Customer_id INT PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100),
    address VARCHAR(255)
);
CREATE TABLE Products (
    Product_id INT PRIMARY KEY,
    name VARCHAR(100),
    price DECIMAL(10, 2)
);
create table Sale(order_id int not null,customer_id int not null,product_id int not null,sales_date date,quantity int not null , total int not null, foreign key (Customer_id) references customers(Customer_id),foreign key(product_id)
 references products(product_id));

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
Done.

[]

In [91]:
%%sql
INSERT INTO Customers (customer_id,name, email, address) VALUES
(101,'Alice Johnson', 'alice.johnson@example.com', '123 Maple St.'),
(102,'Bob Smith', 'bob.smith@example.com', '456 Oak St.'),
(103,'Charlie Brown', 'charlie.brown@example.com', '789 Pine St.'),
(104,'David Wilson', 'david.wilson@example.com', '321 Elm St.'),
(105,'Eva Green', 'eva.green@example.com', '654 Cedar St.')

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[]

In [92]:
%%sql
INSERT INTO Products (product_id,name, price) VALUES
(201,'Laptop', 1200.00),
(202,'Smartphone', 800.00),
(203,'Tablet', 400.00),
(204,'Headphones', 150.00),
(205,'Smartwatch', 250.00);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
5 rows affected.

[]

In [93]:
%%sql
INSERT INTO sale (order_id,customer_id, product_id, sales_date, quantity, total) VALUES
(31,101, 201, '2024-01-15', 1, 1200.00),  -- Alice bought 1 Laptop
(32, 102, 202,'2024-01-16', 2, 1600.00),  -- Alice bought 2 Smartphones
(33, 102,201, '2024-01-17', 1, 1200.00),  -- Bob bought 1 Laptop
(34,102, 203, '2024-01-18', 3, 1200.00),  -- Bob bought 3 Tablets
(35, 103,202, '2024-01-19', 1, 800.00),   -- Charlie bought 1 Smartphone
(36, 103,204, '2024-01-20', 2, 300.00),   -- Charlie bought 2 Headphones
(37, 104,205, '2024-01-21', 1, 250.00),   -- David bought 1 Smartwatch
(38, 105,201, '2024-01-22', 1,1200.00);

 * postgresql+psycopg2://postgres:***@localhost:5432/basics
8 rows affected.

[]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [64]:
%%sql
CREATE TABLE cust (
    id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(100)
);
INSERT INTO cust (name) VALUES
('Ravi Kumar Vinod Narayan Iyer'),
('Asha Lakshmi Priya Devi Menon'),
('Mohammed Farooq Abdul Rahman Khan'),
('Sunita Rani Gita Sharma Kapoor'),
('Hari Prasad Chandra Lal Tiwari');

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
5 rows affected.

[]

In [65]:
%%sql
select * from cust;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 'Ravi Kumar Vinod Narayan Iyer'),
 (2, 'Asha Lakshmi Priya Devi Menon'),
 (3, 'Mohammed Farooq Abdul Rahman Khan'),
 (4, 'Sunita Rani Gita Sharma Kapoor'),
 (5, 'Hari Prasad Chandra Lal Tiwari')]

In [66]:
%%sql
select substring(name,1,-1) as middle from cust;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('',), ('',), ('',), ('',), ('',)]

In [69]:
%%sql
SELECT name,
       LENGTH(name) - LENGTH(REPLACE(name, ' ', '')) + 1 AS word_count,
        LENGTH(name),
LENGTH(REPLACE(name, ' ', ''))

FROM cust;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Ravi Kumar Vinod Narayan Iyer', 5, 29, 25),
 ('Asha Lakshmi Priya Devi Menon', 5, 29, 25),
 ('Mohammed Farooq Abdul Rahman Khan', 5, 33, 29),
 ('Sunita Rani Gita Sharma Kapoor', 5, 30, 26),
 ('Hari Prasad Chandra Lal Tiwari', 5, 30, 26)]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql